app/controllers/books_controller.rb

SELECT "subjects".* FROM "subjects"
SELECT "books".* FROM "books"  ORDER BY created_at DESC
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."name" = ? LIMIT 1  [["name", "Math"]]
SELECT "books".* FROM "books" WHERE "books"."subject_id" = ?  ORDER BY created_at DESC  [["subject_id", 3]]
---
    def index
        if params[:subject].blank?
			@books = Book.all.order("created_at DESC")
		else
			@category_id = Subject.find_by(name: params[:subject]).id
			@books = Book.where(:subject_id => @category_id).order("created_at DESC")

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 10]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 10]]
---
    def show
        if @book.reviews.blank?
			@average_review = 0
		else
			@average_review = @book.reviews.average(:rating).round(2)

SELECT "subjects".* FROM "subjects"
---
    def new
        @book = current_user.books.build
        @subjects=Subject.all.map { |c| [c.name, c.id] }

INSERT INTO "books" ("title", "description", "autor", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "This tan story"], ["description", "this is book"], ["autor", "tan"], ["user_id", 1], ["created_at", "2017-08-25 13:02:12.248877"], ["updated_at", "2017-08-25 13:02:12.248877"]]
---
    def create
        @book = current_user.books.build(book_params)
        @book.subject_id=params[:subject_id]

        if @book.save

SELECT "subjects".* FROM "subjects"
---
    def edit
        @subjects=Subject.all.map { |c| [c.name, c.id] }

UPDATE "books" SET "avater_file_name" = ?, "avater_content_type" = ?, "avater_file_size" = ?, "avater_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = ?
---
    def update
        @book.subject_id=params[:subject_id]
        if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]
---
    def find_book
        @book=Book.find(params[:id])