app/controllers/reviews_controller.rb

    def create
        @review=Review.new(review_params)
        @review.book_id=@book.id
        @review.user_id= current_user.id

        if @review.save
---
INSERT INTO "reviews" ("rating", "command", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["command", "good"], ["book_id", 12], ["user_id", 1], ["created_at", "2017-08-26 05:57:30.357676"], ["updated_at", "2017-08-26 05:57:30.357676"]]

	def update

		if @review.update(review_params)
---
UPDATE "reviews" SET "command" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["command", "so good11"], ["updated_at", "2017-08-26 06:10:03.721114"], ["id", 6]]

    def find_book
        @book=Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 12]]

    def find_review
        @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 6]]